# St7GetSolverSort

Returns the node number re-ordering strategy assigned to the solver.

Strand7 API Manual

long St7GetSolverSort(long uID, long* Sort)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Sort

One of rnNone, rnTree, rnGeometry or rnAMD.